genres = [ ['異世界恋愛', '101'], ['現実世界恋愛', '102'], ['ハイファンタジー', '201'],
           ['ローファンタジー', '202'], ['純文学', '301'], ['ヒューマンドラマ', '302'],
           ['歴史', '303'], ['推理', '304'], ['ホラー', '305'], ['アクション', '306'],
           ['コメディー', '307'], ['VRゲーム', '401'], ['宇宙', '402'], ['空想科学', '403'],
           ['パニック', '404'], ['童話', '9901'], ['詩', '9902'], ['エッセイ', '9903'],
           ['リプレイ', '9904'], ['その他', '9999'], ['ノンジャンル', '9801']]

genres.each.with_index(1) do |(genre, number), i|
  Genre.seed(:id, {id: i, name: genre, parameters: number})
  NotGenre.seed(:id, {id: i, name: genre, parameters: number})
end
